---
kind: other
id: Methods.T:Autodesk.Revit.DB.ComponentRepeaterSlot
source: html/b44a2995-d052-cde8-14b7-a707c4d31b13.htm
---
# ComponentRepeaterSlot Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.